# **assignment03-pie.ipynb**
### A project to display email domains from a csv file in a pie chart
### Author: Paul O'Shaughnessy

In [2]:
# Import Pandas
import pandas as pd

# Import Matplotlib
import matplotlib.pyplot as plt

# Import Numpy
import numpy as np

In [4]:
people = pd.read_csv('people-1000.csv')
people.head(3)

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,8717bbf45cCDbEe,Shelia,Mahoney,Male,pwarner@example.org,857.139.8239,27/01/2014,Probation officer
1,2,3d5AD30A4cD38ed,Jo,Rivers,Female,fergusonkatherine@example.net,-10395,26/07/1931,Dancer
2,3,810Ce0F276Badec,Sheryl,Lowery,Female,fhoward@example.org,(599)782-0605,25/11/2013,Copy

In [8]:
people['domains'] = people['Email'].str.split('@').str[1] # https://stackoverflow.com/questions/14745022/how-to-split-a-dataframe-string-column-into-two-columns
people.head(3)

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title,domains
0,1,8717bbf45cCDbEe,Shelia,Mahoney,Male,pwarner@example.org,857.139.8239,27/01/2014,Probation officer,example.org
1,2,3d5AD30A4cD38ed,Jo,Rivers,Female,fergusonkatherine@example.net,-10395,26/07/1931,Dancer,example.net
2,3,810Ce0F276Badec,Sheryl,Lowery,Female,fhoward@example.org,(599)782-0605,25/11/2013,Copy,example.org